---
kind: other
id: Methods.T:Autodesk.Revit.DB.ValueParsingOptions
source: html/ba206353-2654-6df2-474f-fbd207c23b3d.htm
---
# ValueParsingOptions Methods

Gets the FormatOptions to optionally override the default settings in the Units class.